In [13]:
import pandas as pd
import numpy as np

In [30]:
data = [{'a': 3, 'b': 2, 'c':3}, {'a':1, 'b': 20, 'c': 30}, {'a':1, 'b': 3, 'c': 3}] 
  
df = pd.DataFrame(data) 
  
df

   a   b   c
0  3   2   3
1  1  20  30
2  1   3   3

In [31]:
df.a.replace({3:1, 1:3}, inplace=True)
df.head()

   a   b   c
0  1   2   3
1  3  20  30
2  3   3   3

In [32]:
df.replace({'b':{3:0}, 'c':{3:np.nan}, 'a': {1:np.nan}}, inplace=True)
df.head()

     a   b     c
0  NaN   2   NaN
1  3.0  20  30.0
2  3.0   0   NaN

In [33]:
df.fillna(value={'a':0, 'b':1, 'c':2})

     a   b     c
0  0.0   2   2.0
1  3.0  20  30.0
2  3.0   0   2.0

In [34]:
df.fillna(method='bfill', inplace=True)
df.head()

     a   b     c
0  3.0   2  30.0
1  3.0  20  30.0
2  3.0   0   NaN